GetEdgeConstraint
Syntax
SapObject.SapModel.SolidObj.GetEdgeConstraint
VB6 Procedure
Function GetEdgeConstraint(ByVal Name As String, ByRef ConstraintExists As Boolean) As Long
Parameters
Name
The name of an existing solid object.
ConstraintExists
This item is True if an automatic edge constraint is generated by the program for the solid object in the analysis model.
Remarks
This function retrieves the generated edge constraint assignments to solid objects.
The function returns zero if the assignments are successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetSolidObjEdgeConstraint()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim ConstraintExists As Boolean
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.NewSolidBlock(300, 400, 200, , , 2, 2, 2)
 'assign auto edge constraint option
 ret = SapModel.SolidObj.SetEdgeConstraint("ALL", True, Group)
 'get auto edge constraint option
 ret = SapModel.SolidObj.GetEdgeConstraint("1", ConstraintExists)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
See Also
SetEdgeConstraint